app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"  ORDER BY release_date
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('#<Movie:0x00007f3b72b15cd8>', '#<Movie:0x00007f3b72b15e40>', '#<Movie:0x00007f3b72b15fd0>', '#<Movie:0x00007f3b72b16138>')  ORDER BY release_date
---
    def index
    # Part 2 and Part 3 Section
      @items_sort = params[:sort] or session[:sort]
      @movies_ratings = Movie.ratings


      @entire_ratings =  params[:ratings] or session[:ratings]

      if not @entire_ratings
        session[:ratings] = {}

        for rating in @movies_ratings
          session[:ratings][rating] = 1
        end

        @entire_ratings = session[:ratings]
      end

      @movies = Movie.order(@items_sort)
      if @entire_ratings
        @movies = Movie.where(:rating=> @entire_ratings.keys).order(@items_sort)